app/controllers/books_controller.rb

  def show
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def index
    # 全てのデータをIDの若い順に取り出す
    @books = Book.all.order(created_at: :desc)
---
SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC

  def create
    book = Book.new(book_params)
    if book.save
---
INSERT INTO "books" ("Title", "Body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["Title", "1"], ["Body", "12345678"], ["created_at", "2019-04-07 09:08:27.131175"], ["updated_at", "2019-04-07 09:08:27.131175"]]

  def edit
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    book = Book.find(params[:id])
    book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "Body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["Body", "12345678890"], ["updated_at", "2019-04-07 09:09:55.024283"], ["id", 2]]